mysource/public-notes-org/2023-11-27-org-mode-properties-reuse3.org
#+TITLE: Properties in org-mode
#+DESCRIPTION: 
#+AUTHOR: cissic
#+DATE: <2023-11-27 Mon>
#+TAGS: kde kde-activity windows-manager
# #+OPTIONS: toc:nil
#+OPTIONS: -:nil


* TODO {{{title}}}
:PROPERTIES:
:PRJ-DIR: ./2023-11-27-org-mode-properties-reuse3/
:END:

** Approach 1

Given an org document, I'd like to traverse all headlines of the
given level and extract the headline title, provided that:
1. Headline title can be generated by inline source blocks that use node properties, and
2. I don't know beforehand what are the names of the node properties that are going to be used to generate the headline.

For example for the document given below:

#+begin_src org :tangle (concat (org-entry-get nil "PRJ-DIR" t) "Ex1.org") :mkdirp yes :exports both
  ,* Section about src_elisp{(org-entry-get nil "Name")} :this:
  :PROPERTIES:
  :Name:     J.S. Bach
  :END:

  ,* Section about src_elisp{(org-entry-get nil "Composer")} :this:
  :PROPERTIES:
  :Composer:     W.A. Mozart
  :END:

  ,* Code
  ,#+begin_src elisp :eval yes :results output :exports both
  
  (defun level1-headlines-filter ()
    (setq headline (org-entry-get nil "ITEM"))
    (setq props (org-get-entry))
    (setq string (concat headline "\n" props))
    (setq string (org-export-string-as string 'org t '(:with-toc nil)))
    (setq all (list string)))

  (setq HEADLINES-PARSED (org-map-entries #'level1-headlines-filter "LEVEL=1+this") )

  (print HEADLINES-PARSED)

  ,#+end_src

#+end_src

=HEADLINES-PARSED= should contain strings:

#+begin_example
"Section about J.S. Bach"
"Section about W.A. Moz [[file:///home/mb/org/RDITiT/PrzewodyDoktorskie/Sidor_Kamil (2023)/2. Lista-obecnosci-na-obronie-publicznej.org]] art"
#+end_example

Now the results are:
#+begin_example
"Section about "
"Section about "
#+end_example



** Useful links:


* COMMENT Local Variables

# Local Variables:
# eval: (setq org-latex-pdf-process
#  '("pdflatex -shell-escape -synctex=1 -interaction=nonstopmode -output-directory %o %f"
#    "pdflatex -shell-escape -synctex=1 -interaction=nonstopmode -output-directory %o %f"
#    "pdflatex -shell-escape -synctex=1 -interaction=nonstopmode -output-directory %o %f"))
# End:
 
