_posts/2023-11-27-org-mode-properties-reuse3.md

# Table of Contents

1.  [Properties in org-mode](#org04ce16a)
    1.  [Approach 1](#org1607c21)
    2.  [Useful links:](#org44f9ecc)



<a id="org04ce16a"></a>

# TODO Properties in org-mode


<a id="org1607c21"></a>

## Approach 1

Given an org document, I'd like to traverse all headlines of the
given level and extract the headline title, provided that:

1.  Headline title can be generated by inline source blocks that use node properties, and
2.  I don't know beforehand what are the names of the node properties that are going to be used to generate the headline.

For example for the document given below:

    * Section about src_elisp{(org-entry-get nil "Name")} :this:
    :PROPERTIES:
    :Name:     J.S. Bach
    :END:
    
    * Section about src_elisp{(org-entry-get nil "Composer")} :this:
    :PROPERTIES:
    :Composer:     W.A. Mozart
    :END:
    
    * Code
    #+begin_src elisp :eval yes :results output :exports both
    
    (defun level1-headlines-filter ()
      (setq headline (org-entry-get nil "ITEM"))
      (setq props (org-get-entry))
      (setq string (concat headline "\n" props))
      (setq string (org-export-string-as string 'org t '(:with-toc nil)))
      (setq all (list string)))
    
    (setq HEADLINES-PARSED (org-map-entries #'level1-headlines-filter "LEVEL=1+this") )
    
    (print HEADLINES-PARSED)
    
    #+end_src

`HEADLINES-PARSED` should contain strings:

    "Section about J.S. Bach"
    "Section about W.A. Moz [[file:///home/mb/org/RDITiT/PrzewodyDoktorskie/Sidor_Kamil (2023)/2. Lista-obecnosci-na-obronie-publicznej.org]] art"

Now the results are:

    "Section about "
    "Section about "


<a id="org44f9ecc"></a>

## Useful links:

